Public Attributes | List of all members
API_RoofLevelData Struct Reference
Element Manager
Defines a level of a polyroof plane. This structure is used in API_PolyRoofData. More...
#include <APIdefs_Elements.h>
 Public Attributes
 double  | levelHeight
Height of the level.
 double  | levelAngle
Angle of planes measured from horizontal on this level.
Detailed Description
Defines a level of a polyroof plane. This structure is used in API_PolyRoofData.